
## :white_check_mark: Apply Succeeded (sendgrid-data-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/89689)



<pre><code>Apply complete! Resources: 1 added, 2 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.archive_file.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-default-file_146ED7F9: Reading...
data.archive_file.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-default-file_146ED7F9: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.aws_region.pocket-shared-vpc_current_region_847136C5: Reading...
data.aws_ssm_parameter.pocket-shared-vpc_public_subnets_ED078BA3: Reading...
aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_4DA9F733: Refreshing state... [id=Z05204402KJW5Y6YYVVMS]
data.aws_ssm_parameter.pocket-shared-vpc_private_subnets_899B1172: Reading...
data.aws_ssm_parameter.apigateway-lambda_sentry-dsn_52D8BA00: Reading...
data.aws_ssm_parameter.apigateway-lambda_service-hash_CB1C89E3: Reading...
data.aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_main_hosted_zone_5A756590: Reading...
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:SendGridData-Prod-Infrastructure-Alarm-Critical]
data.aws_region.pocket-shared-vpc_current_region_847136C5: Read complete after 0s [id=us-east-1]
aws_s3_bucket.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket_18555683: Refreshing state... [id=pocket-sendgriddata-prod-apigateway]
data.aws_ssm_parameter.pocket-shared-vpc_private_subnets_899B1172: Read complete after 1s [id=/Shared/PrivateSubnets]
aws_codedeploy_app.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_4D0EC70B: Refreshing state... [id=67899627-28dd-47ee-b9dc-2fe95a3dbba0:SendGridData-Prod-ApiGateway-Lambda]
data.aws_ssm_parameter.pocket-shared-vpc_public_subnets_ED078BA3: Read complete after 1s [id=/Shared/PublicSubnets]
aws_api_gateway_rest_api.apigateway-lambda_api-gateway-rest_FD4A1018: Refreshing state... [id=1oyn6teaa0]
data.aws_ssm_parameter.apigateway-lambda_service-hash_CB1C89E3: Read complete after 1s [id=/SendGridData/CircleCI/Prod/SERVICE_HASH]
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_1C73177E: Reading...
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_1C73177E: Read complete after 0s [id=4250039221]
data.aws_ssm_parameter.apigateway-lambda_sentry-dsn_52D8BA00: Read complete after 1s [id=/SendGridData/Prod/SENTRY_DSN]
data.aws_ssm_parameter.pocket-shared-vpc_vpc_ssm_param_71599A98: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:SendGridData-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_ssm_parameter.pocket-shared-vpc_vpc_ssm_param_71599A98: Read complete after 0s [id=/Shared/Vpc]
aws_acm_certificate.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_997CB9AA: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/72f4abd3-f192-49dc-bfef-2fe0aef4cb19]
data.aws_caller_identity.pocket-shared-vpc_current_identity_C10C97A4: Reading...
data.aws_caller_identity.pocket-shared-vpc_current_identity_C10C97A4: Read complete after 0s [id=996905175585]
data.aws_kms_alias.pocket-shared-vpc_secrets_manager_key_1721F04F: Reading...
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy-document_BD5C86F3: Reading...
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_assume-policy-document_B4DECBDC: Reading...
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy-document_BD5C86F3: Read complete after 0s [id=397813019]
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_assume-policy-document_B4DECBDC: Read complete after 0s [id=1349007126]
aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_9E2AE32B: Refreshing state... [id=SendGridData-Prod-ApiGateway-CodeDeployRole]
data.aws_vpc.pocket-shared-vpc_405D247E: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
aws_iam_policy.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy_77491FAA: Refreshing state... [id=arn:aws:iam::996905175585:policy/SendGridData-Prod-ApiGateway-ExecutionRolePolicy]
data.aws_kms_alias.pocket-shared-vpc_secrets_manager_key_1721F04F: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role_CCB05633: Refreshing state... [id=SendGridData-Prod-ApiGateway-ExecutionRole]
data.aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_main_hosted_zone_5A756590: Read complete after 1s [id=Z21HMDYFB951W4]
aws_api_gateway_resource.apigateway-lambda_sendgrid-data-apigateway-lambda_events_2B884204: Refreshing state... [id=6b9k8q]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C: Refreshing state... [id=Z21HMDYFB951W4_sendgrid-data.getpocket.com_NS]
aws_s3_bucket_ownership_controls.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-ownership-controls_C7E7E6F1: Refreshing state... [id=pocket-sendgriddata-prod-apigateway]
aws_s3_bucket_public_access_block.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-public-access-block_8F10AA5A: Refreshing state... [id=pocket-sendgriddata-prod-apigateway]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_record_9F660571: Refreshing state... [id=Z05204402KJW5Y6YYVVMS__fc1e3b12a2ca1725c0922b0142f71172.sendgrid-data.getpocket.com._CNAME]
aws_api_gateway_method.apigateway-lambda_sendgrid-data-apigateway-lambda_events-method_CADF1EB7: Refreshing state... [id=agm-1oyn6teaa0-6b9k8q-POST]
aws_codedeploy_deployment_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_2C886C54: Refreshing state... [id=087daac0-9b2b-4405-b64f-1abbade365eb]
aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-policy-attachment_2AFCAC87: Refreshing state... [id=SendGridData-Prod-ApiGateway-CodeDeployRole-20240111193803249600000003]
aws_s3_bucket_acl.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-acl_34517214: Refreshing state... [id=pocket-sendgriddata-prod-apigateway,private]
aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role-policy-attachment_8DF035D2: Refreshing state... [id=SendGridData-Prod-ApiGateway-ExecutionRole-20240111193803363500000004]
aws_acm_certificate_validation.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_validation_24F8D637: Refreshing state... [id=2024-01-11 19:39:19.916 +0000 UTC]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 0s [id=PZQ6AUS]
aws_api_gateway_domain_name.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-domain-name_30FE02A4: Refreshing state... [id=sendgrid-data.getpocket.com]
data.aws_vpc.pocket-shared-vpc_405D247E: Read complete after 0s [id=vpc-867638e3]
data.aws_subnets.pocket-shared-vpc_private_subnet_ids_8E7435AC: Reading...
data.aws_subnets.pocket-shared-vpc_public_subnet_ids_D97DEFAB: Reading...
data.aws_security_groups.pocket-shared-vpc_default_security_groups_27768768: Reading...
data.aws_security_groups.pocket-shared-vpc_internal_security_groups_1EABF33F: Reading...
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-route53-domain-record_997C8CE4: Refreshing state... [id=Z05204402KJW5Y6YYVVMS_sendgrid-data.getpocket.com_A]
data.terraform_remote_state.incident_management: Read complete after 1s
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PPRU35K]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PT0F3IN]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 0s [id=PKAPG94]
data.aws_subnets.pocket-shared-vpc_private_subnet_ids_8E7435AC: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-shared-vpc_public_subnet_ids_D97DEFAB: Read complete after 0s [id=us-east-1]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=PNVXQP7]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=P6J9PZH]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PM67P7B]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=P39LOKU]
data.aws_security_groups.pocket-shared-vpc_internal_security_groups_1EABF33F: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-shared-vpc_default_security_groups_27768768: Read complete after 0s [id=us-east-1]
aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476: Refreshing state... [id=SendGridData-Prod-ApiGateway-Function]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:SendGridData-Prod-Infrastructure-Alarm-Non-Critical:f5be51e7-638f-467f-a569-f33f536bea3f]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:SendGridData-Prod-Infrastructure-Alarm-Critical:2a309076-b71f-4585-8372-3ae73a2adfec]
aws_cloudwatch_log_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_log-group_EB81EF26: Refreshing state... [id=/aws/lambda/SendGridData-Prod-ApiGateway-Function]
aws_lambda_alias.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:SendGridData-Prod-ApiGateway-Function:DEPLOYED]
aws_api_gateway_integration.apigateway-lambda_sendgrid-data-apigateway-lambda_events-integration_B8DFA884: Refreshing state... [id=agi-1oyn6teaa0-6b9k8q-POST]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Refreshing state... [id=1nz43w]
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Refreshing state... [id=ags-1oyn6teaa0-prod]
aws_lambda_permission.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F-allow-gateway-lambda-invoke_3CDE9309: Refreshing state... [id=terraform-20240111193819092200000005]
aws_api_gateway_base_path_mapping.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-base-path-mapping_E12C6422: Refreshing state... [id=sendgrid-data.getpocket.com/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-03-15T16:03:23Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:996905175585:1oyn6teaa0/" -> (known after apply)
      ~ id            = "1nz43w" -> (known after apply)
      ~ invoke_url    = "https://1oyn6teaa0.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "deployedAt"   = "1710518560828" -> "1710538602784"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "1nz43w" -> (known after apply)
        id                    = "ags-1oyn6teaa0-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476 will be updated in-place
  ~ resource "aws_lambda_function" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476" {
        id                             = "SendGridData-Prod-ApiGateway-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:SendGridData-Prod-ApiGateway-Function:72" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:SendGridData-Prod-ApiGateway-Function:72/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "72" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"                           = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476: Modifying... [id=SendGridData-Prod-ApiGateway-Function]
aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476: Modifications complete after 8s [id=SendGridData-Prod-ApiGateway-Function]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Creating...
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Creation complete after 0s [id=kasi19]
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Modifying... [id=ags-1oyn6teaa0-prod]
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Modifications complete after 0s [id=ags-1oyn6teaa0-prod]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 (deposed object 5d2a2c75): Destroying... [id=1nz43w]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Destruction complete after 0s

Apply complete! Resources: 1 added, 2 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"e898d1f1-b466-4043-8ac7-a431a875fafc","JobName":"sendgrid-data_infrastructure_apply_prod","PRNumber":304,"Program":"tfcmt","SHA1":"f7bc60f02f2916fbfc10da046c7706cbf473a564","Target":"sendgrid-data-cdk","Vars":{}} -->